#include <stdio.h>
#include <locale.h>

/*
13/01/2025
Задания ... выполняются с текстовым конфигурационным файлом
Он должен быть понятно и подробно закомментирован

Задание 1 ?
В списке целых чисел все элементы между Max и Min заменить полусуммой Max и Min

Задание 2 
реализовать на основе списков класс динамический односвязный список целых чисел и выполнить задание 1
Написать производный класс на основе вот этого и выполнить задание для производного класса (номер 3)
Требования к программам с классами: в каждом классе не менее двух конструкторов 
и деструктор, который чистит динамическую память. К и Д выводят на экран сообщения о своей работе

Задание 3
производные классы: стек, очередь или двух концевая очередь. 
Для каждого определяется операции, которые изменяют состояния. 
Стек: push, pop, очередь: тоже, двухконцевая: взять, положить справа и слева
Только нами написанные классы, не массивы и не переменные
Не требуя прав администратора
*/
int main() {
	printf("AVE CAESAR");
}